["java", ["Java", "Java (programming language)", "JavaScript", "Java version history", "Javanese language", "Java (software platform)", "Javanese script", "Java virtual machine", "Javanese people", "Javan rhinoceros"],
  ["Java (Indonesian: Jawa; Javanese: ꦗꦮ; Sundanese: ᮏᮝ) is an island of Indonesia. At about 138,800 square kilometres (53,600 sq mi), the island is comparable in size to England, the U.S.", "Java is a general-purpose computer-programming language that is concurrent, class-based, object-oriented, and specifically designed to have as few implementation dependencies as possible.", "JavaScript (), often abbreviated as JS, is a high-level, interpreted programming language. It is a language which is also characterized as dynamic, weakly typed, prototype-based and multi-paradigm.", "The Java language has undergone several changes since JDK 1.0 as well as numerous additions of classes and packages to the standard library.", "Javanese  (ꦧꦱꦗꦮ, basa Jawa; Javanese pronunciation: [bɔsɔ dʒɔwɔ]) (colloquially known as ꦕꦫꦗꦮ, cara Jawa; Javanese pronunciation: [tjɔrɔ dʒɔwɔ]) is the language of the Javanese people from the central and eastern parts of the island of Java, in Indonesia.", "Java is a set of computer software and specifications developed by Sun Microsystems, which was later acquired by the Oracle Corporation, that provides a system for developing application software and deploying it in a cross-platform computing environment.", "The Javanese script, natively known as Aksara Jawa (ꦲꦏ꧀ꦱꦫꦗꦮaksarajawa) and Hanacaraka (ꦲꦤꦕꦫꦏhanacaraka), is an abugida developed by the Javanese people to write several Austronesian languages spoken in Indonesia, primarily the Javanese language and an early form of Javanese called Kawi, as well as Sanskrit, an Indo-Aryan language used as a sacred language throughout Asia.", "A Java virtual machine (JVM) is a virtual machine that enables a computer to run Java programs as well as programs written in other languages and compiled to Java bytecode.", "The Javanese (Ngoko Javanese: ꦮꦺꦴꦁꦗꦮ, Madya Javanese: ꦠꦶꦪꦁꦗꦮꦶ, Krama Javanese: ꦥꦿꦶꦪꦤ꧀ꦠꦸꦤ꧀ꦗꦮꦶ, Ngoko Gêdrìk: wòng Jåwå, Madya Gêdrìk: tiyang Jawi, Krama Gêdrìk: priyantun Jawi, Indonesian: suku Jawa) are an ethnic group native to the Indonesian island of Java.", "The Javan rhinoceros (Rhinoceros sondaicus), also known as the Sunda rhinoceros or lesser one-horned rhinoceros, is a very rare member of the family Rhinocerotidae and one of five extant rhinoceroses."],
  ["https://en.wikipedia.org/wiki/Java", "https://en.wikipedia.org/wiki/Java_(programming_language)", "https://en.wikipedia.org/wiki/JavaScript", "https://en.wikipedia.org/wiki/Java_version_history", "https://en.wikipedia.org/wiki/Javanese_language", "https://en.wikipedia.org/wiki/Java_(software_platform)", "https://en.wikipedia.org/wiki/Javanese_script", "https://en.wikipedia.org/wiki/Java_virtual_machine", "https://en.wikipedia.org/wiki/Javanese_people", "https://en.wikipedia.org/wiki/Javan_rhinoceros"]
]